Repository: seanpm2001/mt-training-data
Catalog: ppl/ppl_pontoon.tmx
Source language: en_us
Languages: ppl

source: Expires after { $downloadCount } or { $timespan }
ppl: Puliwi kwak ajsi { $downloadCount } ush { $timespan }

source: Feedback
ppl: Shitechnawati

source: Firefox Send requires JavaScript
ppl: Firefox Send muneki JavaScript

source: Importing…
ppl: Mukalaktia nemi…

source: Incorrect password. Try again.
ppl: Ne ichtakatajkwilul tesu yek. Shikejeku uksenpa.

source: Keep links active for up to { $count } days
ppl: Shikpia ne ilpika tapujtuk { $count } tunal

source: Learn about other { -mozilla } services
ppl: Shikmati ipanpa ukse { -mozilla } tayekultilis

source: Link expired
ppl: Ne ilpika pulijtuk

source: Manage shared files from any device
ppl: Shiktajpia ne tajkwilul takulijtuk ka kanaj

source: Maximum password length: { $length }
ppl: Ne iweyaka ne ichtakatajkwilul muneki: { $length }

source: { $num } days
ppl: { $num } tunal

source: { $num } downloads
ppl: { $num } temultijtuk

source: { $num } files
ppl: { $num } tajkwilul

source: { $num } hours
ppl: { $num } oraj

source: { $num } minutes
ppl: { $num } minutoj

source: { $num } weeks
ppl: { $num } semanaj

source: Only { $count } archives are allowed.
ppl: Semaya { $count } amapial weli mutitania.

source: Only { $count } files can be uploaded at a time.
ppl: Semaya { $count } tajkwilul weli pal tiktejkultia sansepa.

source: or click to send up to { $size }
ppl: u shikpachu pal tiktitania { $size }

source: ({ $partialSize } of { $totalSize })
ppl: ({ $partialSize } ipal { $totalSize })

source: Please enable JavaScript and try again.
ppl: Shichiwa ma JavaScript tekiti wan shikejeku uksenpa.

source: Protect with password
ppl: Shiktajpia iwan ichtakatajkwilul

source: Select files to upload
ppl: Shikpejpena ne tajkwilul pal tiktejkultia

source: Send
ppl: Shiktitani

source: { -send-brand } lets you share files with end-to-end encryption and a link that automatically expires. So you can keep what you share private and make sure your stuff doesn’t stay online forever.
ppl: { -send-brand } metzpalewia tikmajmaka se tajkwilul iwan taichtakawilis wan se ilpika puliwi nemanha. Yajika, tikpia muichtakayu pal tikmajmaka wan tesu naka senpa mutajtatka tik matapan.

source: { -send-brand } will not work with this browser. { -send-short-brand } works best with the latest version of { -firefox }, and will work with the current version of most browsers.
ppl: { -send-brand } tesu yawi tekiti iwan ini tachialuni. { -send-short-brand } tekiti sujsul yek iwan ne tipan tamakalis ipal { -firefox }, wan nusan iwan ne tipan tamakalis ipal miak tachialuni.

source: { -send-short-brand } is brought to you by the all-new { -firefox }.
ppl: Ne yankwik { -firefox } metzwikilia { -send-short-brand }.

source: { -send-short-brand } Privacy Notice
ppl: { -send-short-brand } Tanawatilis ipanpa teichtakayu

source: Share files up to { $size }
ppl: Shiktakuli tajtajkwilul ka { $size }

source: Share files with more people
ppl: Shiktakuli tajtajkwilul iwan seuk

source: Share the link to your file:
ppl: Shiktakuli ne ilpika ipal mutajkwilul:

source: Sign in to send up to { $size }
ppl: Shiktali mutukay pal tiktitania { $size }

source: Sign out
ppl: Shikisa

source: Simple, private file sharing
ppl: Shikmajmaka se tajkwilul, te uij wan ichtaka

source: Something went wrong!
ppl: IJtakawtuk!

source: That file is too big to upload. It should be less than { $size }
ppl: Ini tajkwilul sujsul etek pal tiktejkultia. Ma nemi san { $size }.

source: There is a way to protect your privacy. Join Firefox.
ppl: Nemi ken pal tiktajpia ne muichtakayu. Shimuishtuka iwan Firefox.

source: This browser might not be able to decrypt a file this big.
ppl: Ini tachialuni anka te weli kichtakapua ini tajkwilul wey.

source: This file was shared via { -send-brand } with end-to-end encryption and a link that automatically expires.
ppl: Ini tajkwilul kiski itech { -send-brand } iwan taichtakawilis wan se ilpika ka puliwi nemanha.

source: This link has expired.
ppl: Ne ilpika puliwik.

source: This password could not be set
ppl: Te tiweliket tiktaliat ini ichtakataketzalis

source: Total size: { $size }
ppl: Itamachiwka: { $size }

source: Try Firefox Send
ppl: Shikejeku Firefox Send

source: Try our favorite browser
ppl: Shikejeku ne tachialuni tikishwelitat

source: Try { -send-brand } for simple, safe file sharing.
ppl: Shikejeku { -send-brand } wan shiktakuli ichtaka wan te uij.

source: Unfortunately this version of Firefox does not support the web technology that powers Firefox Send. You’ll need to update your browser.
ppl: Ini tamakalis ipal Firefox tesu kimati ne tzawaltekitilis ne kiyulitia Firefox Send. Nemi pal tikyankwilia ne mutachialuni.

source: Update Firefox
ppl: Shikyankwili Firefox

source: Upload
ppl: Shiktejkulti

source: Version 1.0, dated March 12, 2019
ppl: Tamakalis 1.0, tik marzoj 12, 2019

source: Why does Firefox Send require JavaScript?
ppl: Taika Firefox Send muneki JavaScript?

source: Why is my browser not supported?
ppl: Taika te ankishmatit nutachialuni?

source: Your browser is not supported.
ppl: Te tikishmatit ne mutachialuni.

source: Your file is encrypted and ready to send
ppl: Ne archivoj nemi ichtakawijtuk wan weli tiktitania
